In [356]:
import pandas as pd
import numpy as np

In [357]:
x_train = pd.read_csv('titanic_x_train.csv', encoding='cp949')
x_test = pd.read_csv('titanic_x_test.csv', encoding='cp949')
y_train = pd.read_csv('titanic_y_train.csv')

In [358]:
y_train.head()

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

In [359]:
x_train.head()

,PassengerId,티켓등급,승객이름,성별,나이,형제자매배우자수,부모자식수,티켓번호,운임요금,객실번호,선착장
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [360]:
x_test.head()

,PassengerId,티켓등급,승객이름,성별,나이,형제자매배우자수,부모자식수,티켓번호,운임요금,객실번호,선착장
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [361]:
x_test_id = x_test['PassengerId']
x_train.drop(columns=['PassengerId','승객이름','티켓번호','객실번호','나이'], inplace=True)
x_test.drop(columns=['PassengerId','승객이름','티켓번호','객실번호','나이'], inplace=True)
y_train.drop(columns=['PassengerId'], inplace=True)

In [362]:
data = pd.concat([x_train, y_train], axis=1)
data.corr()

              티켓등급  형제자매배우자수     부모자식수      운임요금  Survived
티켓등급      1.000000  0.083081  0.018443 -0.549500 -0.338481
형제자매배우자수  0.083081  1.000000  0.414838  0.159651 -0.035322
부모자식수     0.018443  0.414838  1.000000  0.216225  0.081629
운임요금     -0.549500  0.159651  0.216225  1.000000  0.257307
Survived -0.338481 -0.035322  0.081629  0.257307  1.000000

In [363]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   티켓등급      891 non-null    int64
 1   성별        891 non-null    object
 2   형제자매배우자수  891 non-null    int64
 3   부모자식수     891 non-null    int64
 4   운임요금      891 non-null    float64
 5   선착장       889 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 41.9+ KB

In [364]:
x_train.isnull().sum()
# x_test.isnull().sum()

티켓등급        0
성별          0
형제자매배우자수    0
부모자식수       0
운임요금        0
선착장         2
dtype: int64

In [365]:
x_train.선착장 = x_train.선착장.fillna(method='ffill')
x_test.운임요금 = x_test.운임요금.fillna(method='ffill')
# help(pd.DataFrame.fillna)

In [366]:
x_train = pd.get_dummies(x_train, columns=['성별','선착장'],drop_first=True)
x_test = pd.get_dummies(x_test, columns=['성별','선착장'],drop_first=True)

In [367]:
data = pd.concat([x_train,y_train],axis=1)
data.corr()

,티켓등급,형제자매배우자수,부모자식수,운임요금,성별_male,선착장_Q,선착장_S,Survived
티켓등급,1.000000,0.083081,0.018443,-0.549500,0.131900,0.213504,0.081720,-0.338481
형제자매배우자수,0.083081,1.000000,0.414838,0.159651,-0.114631,-0.028085,0.070941,-0.035322
부모자식수,0.018443,0.414838,1.000000,0.216225,-0.245489,-0.082636,0.063036,0.081629
운임요금,-0.549500,0.159651,0.216225,1.000000,-0.182333,-0.112712,-0.166603,0.257307
성별_male,0.131900,-0.114631,-0.245489,-0.182333,1.000000,-0.079067,0.125722,-0.543351
선착장_Q,0.213504,-0.028085,-0.082636,-0.112712,-0.079067,1.000000,-0.500146,0.008660
선착장_S,0.081720,0.070941,0.063036,-0.166603,0.125722,-0.500146,1.000000,-0.155660
Survived,-0.338481,-0.035322,0.081629,0.257307,-0.543351,0.008660,-0.155660,1.000000

In [368]:
x_train['가족수'] = x_train.형제자매배우자수 + x_train.부모자식수
x_test['가족수'] = x_test.형제자매배우자수 + x_test.부모자식수
x_train.drop(columns=['형제자매배우자수','부모자식수'], inplace=True)
x_test.drop(columns=['형제자매배우자수','부모자식수'], inplace=True)

In [369]:
x_train

     티켓등급     운임요금  성별_male  선착장_Q  선착장_S  가족수
0       3   7.2500        1      0      1    1
1       1  71.2833        0      0      0    1
2       3   7.9250        0      0      1    0
3       1  53.1000        0      0      1    1
4       3   8.0500        1      0      1    0
..    ...      ...      ...    ...    ...  ...
886     2  13.0000        1      0      1    0
887     1  30.0000        0      0      1    0
888     3  23.4500        0      0      1    3
889     1  30.0000        1      0      0    0
890     3   7.7500        1      1      0    0

[891 rows x 6 columns]

In [373]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
x_train['운임요금'] = scaler.fit_transform(x_train[['운임요금']])
x_test['운임요금'] = scaler.fit_transform(x_test[['운임요금']])

In [375]:
from sklearn.model_selection import train_test_split
X_TRAIN, X_TEST, Y_TRAIN, Y_TEST = train_test_split(x_train, y_train, random_state=1234)

In [376]:
from xgboost import XGBClassifier
model = XGBClassifier(n_estimators=100, max_depth=5)
# help(model)
model.fit(X_TRAIN, Y_TRAIN)

/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/xgboost/sklearn.py:1224: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)
/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/sklearn/preprocessing/_label.py:98: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/sklearn/preprocessing/_label.py:133: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/xgboost/data.py:250: FutureWarning: pandas.Int64Index is deprecated and will be removed from pandas in a future version. Use pandas.Index with the appropriate dtype instead.
  elif isinstance(data.columns, (pd.Int64Index, pd.RangeIndex)):

[01:07:41] WARNING: /var/folders/sy/f16zz6x50xz3113nwtb9bvq00000gp/T/abs_44tbtwf8c1/croots/recipe/xgboost-split_1659548960882/work/src/learner.cc:1115: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, enable_categorical=False,
              gamma=0, gpu_id=-1, importance_type=None,
              interaction_constraints='', learning_rate=0.300000012,
              max_delta_step=0, max_depth=5, min_child_weight=1, missing=nan,
              monotone_constraints='()', n_estimators=100, n_jobs=8,
              num_parallel_tree=1, predictor='auto', random_state=0,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, subsample=1,
              tree_method='exact', validate_parameters=1, verbosity=None)

In [382]:
X_TRAIN_PRE = pd.DataFrame(model.predict(X_TRAIN),columns=['Survived'])
X_TEST_PRE = pd.DataFrame(model.predict(X_TEST), columns=['Survived'])
x_test_pre = pd.DataFrame(model.predict(x_test), columns=['Survived'])

In [388]:
from sklearn.metrics import accuracy_score, roc_auc_score
accuracy_score(Y_TRAIN, X_TRAIN_PRE)
roc_auc_score(Y_TRAIN, X_TRAIN_PRE)
accuracy_score(Y_TEST, X_TEST_PRE)
roc_auc_score(Y_TEST, X_TEST_PRE)

0.8037379287379287

In [390]:
final = pd.concat([x_test_id, x_test_pre], axis=1)
final

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]